<template>
  <div class="post">
    <div class="post-header">
      <span class="post-number">192392138729</span>
      <span class="post-name"></span>
      <span class="post-date"> 02.03.2001</span>
    </div>
    <div class="post-content">
      <p>Игорь, ты? Помнишь меня? Я твой одноклассник. Я узнал тебя по твоим шизоидным словам и высерам. А помнишь, как мы всем классом нассали тебе в кружку в третьем классе, на сладкоежке? Ты ещё выпил, облизнулся и попросил добавки. А потом тебя пришёл забирать твой отец, тот самый дворник, который на Вернадского изнасиловал собаку и получил условный срок за то, что украл плавленный сырок в магазине. Он зашёл в класс, все стали смеяться, а ты обосрался под себя от стыда, а потом сказал, что всю жизнь будешь ненавидеть дворником, но в 9м классе, когда ты пошёл на рейд, чтобы их отпиздить, то они пустили тебя по кругу, после чего тебе наложили на анус восемь швов. Как поживаешь, Игорян</p>
    </div>
    <div class="post-footer">
      <button>Ответить</button>
    </div>
  </div>
</template>

<script lang="ts" setup>

// код который всё импортирует

// код создаёт константные переменные которые должны получить через пропсы значения для имени, номера поста и даты а также текста 

// фукция реплай

</script>

<style>
.post {
  margin-bottom: 20px;
  padding: 10px;
  border-bottom: 1px solid #ccc;
}

.post-header {
  font-size: 14px;
  color: #666;
}

.post-content {
  font-size: 16px;
  margin-top: 10px;
}

.post-footer {
  margin-top: 10px;
  text-align: right;
}
</style>